Documents/ЗакупНеноменклатурный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ЗакупНеноменклатурный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеноменклатурныйМатериал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГдеКупить</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакупНеноменклатурный/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗакупНеноменклатурный.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакупНеноменклатурный.Автор,
	|	ЗакупНеноменклатурный.Дата,
	|	ЗакупНеноменклатурный.Номер,
	|	ЗакупНеноменклатурный.Подразделение,
	|	ЗакупНеноменклатурный.НеноменклатурныйМатериал.(
	|		НомерСтроки,
	|		Спецификация,
	|		Номенклатура,
	|		Наименование,
	|		ЕдиницаИзмерения,
	|		ГдеКупить,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ЗакупНеноменклатурный КАК ЗакупНеноменклатурный
	|ГДЕ
	|	ЗакупНеноменклатурный.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНеноменклатурныйМатериалШапка = Макет.ПолучитьОбласть("НеноменклатурныйМатериалШапка");
	ОбластьНеноменклатурныйМатериал = Макет.ПолучитьОбласть("НеноменклатурныйМатериал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНеноменклатурныйМатериалШапка);
		ВыборкаНеноменклатурныйМатериал = Выборка.НеноменклатурныйМатериал.Выбрать();
		Пока ВыборкаНеноменклатурныйМатериал.Следующий() Цикл
			ОбластьНеноменклатурныйМатериал.Параметры.Заполнить(ВыборкаНеноменклатурныйМатериал);
			ТабДок.Вывести(ОбластьНеноменклатурныйМатериал, ВыборкаНеноменклатурныйМатериал.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
